//
//  Questions.swift
//  martion01
//
//  Created by lucie on 2018. 9. 13..
//  Copyright © 2018년 lucie. All rights reserved.
//

import UIKit

class Questions : UIViewController {
    
    var Q = [ "1. 나는, 다른 사람의 행동을 따라하는 것이 어렵다",
        "2. 모임에서 타인을 위해 좋아할 말이나 행동을 좀처럼 하지 않는다",
        "3. 내게 익숙하지 않은 것을 받아들이는 것이 두렵다",
        "4. 나는 잘 모르는 것에 대해서 즉석에서(즉흥적으로) 떠들 수 있다",
        "5. 나는 타인을 즐겁게 만드는 편이다",
        "6. 내가 만약 연극이나 연기를 한다면 좋은 배우가 될 수 있을 것이다",
        "7. 사람이 많은 모인 곳에서 나는 주변인이 된다 (중심에 서지 않는다. 못한다)",
        "8. 낯선 상황에 있거나 낯선 사람들과 일할 때, 평소의 내 모습처럼 행동하지 못한다",
        "9. 나는 다른 사람들이 나를 좋아하도록 일부러 노력하지 않는 편이다.",
        "10. 나는 다른 사람들이 좋아하는 대로 일부러 나 자신을 바꾸려고 하지 않는다",
        "11. 나는 누군가 때문에 나의 의견이나 내가 행동하는 방식을 바꾸지 않는다",
        "12. 조직에서 나는 때때로 나 자신이기 보다 엔터테이너가 되는 것 같다",
        "13. 나는 (발표, 연기, 연설 등) 남들 앞에 서는 것을 잘 못 한다",
        "14. 나는 다른 사람들이나 다른 상황에 맞추기 위해 행동하는 것이 어렵다",
        "15. 모임에서, 다른 사람들이 농담을 하거나 이야기를 할 때 주로 듣는 편이다",
        "16. 나는 남들 앞에 서는 것이 어색하고, 원래 내 모습을 보여주는 것이 어렵다",
        "17. 나는 다른 사람의 눈을 보여 거짓말을 할 수 있다",
        "18. 나는 내가 싫어하는 사람들 앞에서 친한 척하며 행동할 수 있다"
            ]
}
